हिंदी शब्द की उत्पति 'सिन्धु' से जुडी है। 'सिन्धु' 'सिंध' नदी को कहते है। सिन्धु नदी के आस-पास का क्षेत्र सिन्धु प्रदेश कहलाता है। संस्कृत शब्द 'सिन्धु' ईरानियों के सम्पर्क में आकर हिन्दू या हिंद हो गया। ईरानियों द्वारा उच्चारित किया गए इस हिंद शब्द में ईरानी भाषा का 'एक' प्रत्यय लगने से 'हिन्दीक' शब्द बना है जिसका अर्थ है 'हिंद का'। यूनानी शब्द 'इंडिका' या अंग्रेजी शब्द 'इंडिया' इसी 'हिन्दीक' के ही विकसित रूप है।

my name is vishal. I am from Pune.

मोबाईल फोन हा आधुनिक जीवनातील एक महत्त्वाचा तांत्रिक शोध आहे.माझे नाव यश आहे. मी तुमसर मध्ये राहतो.